name: "my_model"
platform: "tensorrt_plan"
max_batch_size: 1

input [
  {
    name: "input_tensor"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "output_tensor"
    data_type: TYPE_FP32
    dims: [10]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

dynamic_batching { }
